# -*- coding: utf-8 -*-
### ===================================== other.py ========================================
###
### Author:			Igor Tyukalov
### License:		BSD
### Date:			09.02.2016
### ========================================================================================

def voltageLoss(**kwargs):
    """
    Расчёт потерь напряжения в электрических сетях.
    Параметры:
    network		- экземпляр класса Network;
    point		- расчётная точка;
    voltage		- номинальное напряжение, В;
    amperage	- расчётный ток, А;
    power		- активная мощность потребителя, Вт;
    cos			- коэффициент мощности;
    mode		- режим (onephase, threephase)
    """
    

### ================================= End other.py ========================================
